In [ ]:
#1 Establish a connection between Python and the Sakila database.

In [1]:
pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [2]:
pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\expertlead admin\appdata\roaming\python\python312\site-packages (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

# Note that when you use _SQLAlchemy_ and establish the connection, you do not even need to be logged in Sequel Pro or MySQL Workbench.

 ········

In [4]:
sd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+sd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [6]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM actor')
    result = connection.execute(query)

result

In [ ]:
with engine.connect() as connection:
    query = text(f'''SELECT * FROM customer
                WHERE first_name LIKE "K%" AND active = 1;''')
    result = connection.execute(query)
    df = pd.DataFrame(result.all())

df

In [ ]:
#2 Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database
#as a Pandas DataFrame. The function should take in three parameters:

# point1. engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
# point2. month: an integer representing the month for which rental data is to be retrieved.
# point3. year: an integer representing the year for which rental data is to be retrieved.
#The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database,
#and return it as a pandas DataFrame.

In [33]:
def rentals_month(engine, Month, Year):
     with engine.connect() as connection:
         txt = f'''SELECT *,
                  year(rental_Date),
                  Month(rental_Date)
                 FROM Rental
                 WHERE year(rental_date) = {Year} AND Month(rental_date) = {Month}
                 ;'''
         query = text(txt)
         result = connection.execute(query)
     return pd.DataFrame(result.all())

In [34]:
rentals_month(engine, 5, 2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,year(rental_Date),Month(rental_Date)
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005,5
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005,5
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005,5
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005,5
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005,5
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,2005,5
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,2005,5
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,2005,5
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2005,5
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,2005,5

In [ ]:
# 3 Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year 
#and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

# The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, 
#if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

In [58]:
def rental_count_month(rentals_month_engine, month, year):
    result = df.groupby('customer_id').size().reset_index()
    column_name = f"rentals_{month:02d}_{year}"
    month_rentals = rentals_month(engine, 5, 2005)
    rental_counts = rental_count_month(month_rentals, 5, 2005)
    return rental_counts

In [59]:
rental_count_month